docs/c_basic/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2024-07-24 Wed 12:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>title</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">title</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7fb0aa2">1. 2-4-2 a,b,cの置換</a>
<ul>
<li><a href="#orgfb00f4a">1.1. 課題</a></li>
<li><a href="#orgbda918e">1.2. メモ</a>
<ul>
<li><a href="#org4c6cd8a">1回目</a></li>
<li><a href="#org1133abe">2回目</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc652892">2. 2_5 分度器</a>
<ul>
<li><a href="#org0671e26">2.1. 課題</a></li>
<li><a href="#org9392f8e">2.2. メモ</a>
<ul>
<li><a href="#org679972d">1回目</a></li>
<li><a href="#org5b42c15">2回目-</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7fb0aa2" class="outline-2">
<h2 id="org7fb0aa2"><span class="section-number-2">1.</span> 2-4-2 a,b,cの置換</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfb00f4a" class="outline-3">
<h3 id="orgfb00f4a"><span class="section-number-3">1.1.</span> 課題</h3>
<div class="outline-text-3" id="text-1-1">
<p>
変数a,b,cがある。a←b←cとプログラムで３つの値を入れ替えてみよ
</p>
</div>
</div>

<div id="outline-container-orgbda918e" class="outline-3">
<h3 id="orgbda918e"><span class="section-number-3">1.2.</span> メモ</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4c6cd8a" class="outline-4">
<h4 id="org4c6cd8a">1回目</h4>
<div class="outline-text-4" id="text-org4c6cd8a">
<p>
授業で習ったtempを用いて考える、簡単に入れ替えることができた
</p>
</div>
</div>

<div id="outline-container-org1133abe" class="outline-4">
<h4 id="org1133abe">2回目</h4>
<div class="outline-text-4" id="text-org1133abe">
<ul class="org-ul">
<li>tmp=a; 代入のために用意したtempにaを代入</li>
<li>a=b;　　aにbを代入</li>
<li>b=c;　　bにcを代入</li>
<li>c=tmp;　cにtempを代入</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc652892" class="outline-2">
<h2 id="orgc652892"><span class="section-number-2">2.</span> 2_5 分度器</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0671e26" class="outline-3">
<h3 id="org0671e26"><span class="section-number-3">2.1.</span> 課題</h3>
<div class="outline-text-3" id="text-2-1">
<p>
度数法の２つの角度a,b(0&lt;=a,b&lt;360)の和(a+b)と差(a-b)の値を、それぞれ0以上360未満で求めよ。(つまり、例えば360なら0、-1なら359にせよ。)
</p>
</div>
</div>

<div id="outline-container-org9392f8e" class="outline-3">
<h3 id="org9392f8e"><span class="section-number-3">2.2.</span> メモ</h3>
<div class="outline-text-3" id="text-2-2">
<p>
度数法の２つの角度a,b(0&lt;=a,b&lt;360)の和(a+b)と差(a-b)の値を、それぞれ0以上360未満で求めよ。(つまり、例えば360なら0、-1なら359にせよ。)(2_5)
二つの角度a,b（0&lt;=a,b&lt;360)の和と差の値を0～360未満で求める
</p>
</div>

<div id="outline-container-org679972d" class="outline-4">
<h4 id="org679972d">1回目</h4>
<div class="outline-text-4" id="text-org679972d">
<p>
和と差がそれぞれ0より上の数であればそれぞれを360で割った数を表示
負の値となるときどのように表示するか。
和と差が負の値を取るとき360にそれぞれを360で割った数を足して表示
</p>
</div>
</div>

<div id="outline-container-org5b42c15" class="outline-4">
<h4 id="org5b42c15">2回目-</h4>
<div class="outline-text-4" id="text-org5b42c15">
<p>
int sum=a+b;　sumにはaとbの和
int dif=a-b;　difにはaとbの差
</p>


<p>
sum=(sum%360+360)%360;　sumを360で割った余りに360を足しそれを360で割った余りをsumに代入
dif=(dif%360+360)%360;　difも同様
</p>

<p>
こうすることによって構文をスッキリさせることができ、無駄な計算を省ける
二回目で気付くことができた
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #cdad00;">#include</span><span style="color: #8b7355;">&lt;stdio.h&gt;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #00688b;">int</span> <span style="color: #cd9b1d;">main</span>(<span style="color: #00688b;">void</span>)
<span class="linenr"> 4: </span>{
<span class="linenr"> 5: </span>        <span style="color: #00688b;">int</span> <span style="color: #2e8b57;">a</span>=10;
<span class="linenr"> 6: </span>        <span style="color: #00688b;">int</span> <span style="color: #2e8b57;">b</span>=-15;
<span class="linenr"> 7: </span>        <span style="color: #00688b;">int</span> <span style="color: #2e8b57;">sum</span>=a+b;
<span class="linenr"> 8: </span>        <span style="color: #00688b;">int</span> <span style="color: #2e8b57;">dif</span>=a-b;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>        sum=(sum%360+360)%360;
<span class="linenr">12: </span>        dif=(dif%360+360)%360;
<span class="linenr">13: </span>
<span class="linenr">14: </span>        printf(<span style="color: #8b7355;">"sum=%d dif=%d\n"</span>,sum,dif);
<span class="linenr">15: </span>
<span class="linenr">16: </span>        <span style="color: #1c86ee;">return</span> 0;
<span class="linenr">17: </span>}&#9166;      
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2024-07-24 Wed 12:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
